# Working with CSVs
CSV Files

Read CSV

In [5]:
import pandas as pd
df = pd.read_csv("data.csv")
df

      NAME SCHOOL  MARKS
0    anshi    DPS     56
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89
4    aliza    RDS     45
5    sanya    RDS     56

In [7]:
df = df[df['MARKS']>70]

In [9]:
df

      NAME SCHOOL  MARKS
1  anshika    DPS     78
2    avani    LLS     89
3    priya    LLS     89

In [11]:
df.to_csv("data_updated.csv")

In [13]:
df.to_csv("data_updated2.csv",index=False)

In [19]:
df=pd.read_json("newdata.json")
df

      name  age
0  Anshika   20
1   Babita   22